app/Services/AppointmentService.php

select * from `appointments` where (`spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `appointment_status` = 'reserved') and `appointments`.`deleted_at` is null
---
    public function getUpcoming($id)
    {
        $appointment = Appointment::where(['spa_id' => $id, 'appointment_status' => 'reserved'])->get()->count();

select * from `appointments` where (`spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `appointment_status` = 'reserved') and `appointments`.`deleted_at` is null
---
    public function getUpcomingGuest($id)
    {
        $appointment = Appointment::where(['spa_id' => $id, 'appointment_status' => 'reserved'])->with('client')->get();

select * from `spas` where `spas`.`id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `spas`.`deleted_at` is null limit 1
---
    public function getAppointmentResponses($id)
    {
        $spa = Spa::findOrFail($id);

select * from `transactions` where `room_id` = 1 and `spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `end_time` >= '2023-06-04 11:25:46' and `transactions`.`deleted_at` is null limit 1
---
    private function getData($room, $spa_id)
    {
        $now = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-d H:i:s');
        $transaction = Transaction::where(
            'room_id', $room
        )->where('spa_id', $spa_id)->where(
            'end_time', '>=', $now
        )->with(['client'])->first();