app/Http/Controllers/Receptionists/ReceptionistController.php

    public function index()
    {
        $request = request()->filled('id');
        if ($request) {
            $spa_id = request()->id;
        } else {
            $id = auth()->user()->id;
            $user = User::findOrFail($id);

            $spa_id = '';
            if (!empty($user->spa_id)) {
                $spa_id = $user->spa_id;
            }
        }

        $spa = Spa::findOrFail($spa_id);
---
select * from `spas` where `spas`.`id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `spas`.`deleted_at` is null limit 1

    public function lists($id)
    {
        $spa = Spa::findOrFail($id);
---
select * from `spas` where `spas`.`id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `spas`.`deleted_at` is null limit 1

    public function getData($room, $spa_id)
    {
        $now = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-d H:i:s');
        $transaction = Transaction::where(
            'room_id', $room
        )->where('spa_id', $spa_id)->where(
            'end_time', '>=', $now
        )->with(['client'])->first();
---
select * from `transactions` where `room_id` = 1 and `spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `end_time` >= '2023-06-04 11:25:47' and `transactions`.`deleted_at` is null limit 1

    public function getServices($id)
    {
        $service = Service::where('spa_id', $id)->pluck('id', 'name');
---
select `id`, `name` from `services` where `spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `services`.`deleted_at` is null