app/Http/Controllers/Owners/OwnerController.php

    public function dashboard()
    {
        $id = auth()->user()->id;
        $owner = Owner::where('user_id', $id)->first();
        $spa = Spa::where('owner_id', $owner->id)->get();
---
select * from `owners` where `user_id` = 'e94948c9-abad-412b-a799-65f8241f0b10' and `owners`.`deleted_at` is null limit 1
select * from `spas` where `owner_id` = '9aa00f2e-ede1-457d-9d9f-68b25385e3e0' and `spas`.`deleted_at` is null