app/Http/Controllers/TransactionController.php

    public function getTotalSales($id)
    {
        $now = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-d H:i:s');

        $transaction = Transaction::where('spa_id', $id)
            ->where('amount','>', 0)
            ->where('end_time', '>=', $now)
            ->with(['client'])->get();
---
select * from `transactions` where `spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `amount` > 0 and `end_time` >= '2023-06-04 11:25:47' and `transactions`.`deleted_at` is null

    public function getTherapistAvailability($id)
    {
        $therapist = Therapist::where([
            'spa_id' => $id,
        ])->with(['user'])->get();
---
select * from `therapists` where (`spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac') and `therapists`.`deleted_at` is null

    public function getData($id)
    {
        $user_id = auth()->user()->id;
        $todays_from = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-d 00:00:00');
        $todays_to = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-d 23:59:59');

        $months_from = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-01 00:00:00');
        $months_to = Carbon::now()->setTimezone('Asia/Manila')->format('Y-m-t 23:59:59');

        $dailyTransaction = Transaction::where([
            'spa_id' => $id,
        ])->whereDate('start_time', '>=', $todays_from)->whereDate('end_time', '<=', $todays_to)->get();

        $dailyTransactionCount = 0;
        $dailyClient = [];
        if ($dailyTransaction->count() > 0) {
            $dailyTransactionCount = $dailyTransaction->count();
            foreach ($dailyTransaction as $dailyTransactions) {
                $dailyClient [] = $dailyTransactions->client_id;
            }

            $dailyClient = array_unique($dailyClient);
        }

        $monthlyTransaction = Transaction::where([
            'spa_id' => $id,
        ])->whereDate('start_time', '>=', $months_from)->whereDate('end_time', '<=', $months_to)->get();
---
select * from `transactions` where (`spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac') and date(`start_time`) >= '2023-06-04 00:00:00' and date(`end_time`) <= '2023-06-04 23:59:59' and `transactions`.`deleted_at` is null
select * from `transactions` where (`spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac') and date(`start_time`) >= '2023-06-01 00:00:00' and date(`end_time`) <= '2023-06-30 23:59:59' and `transactions`.`deleted_at` is null

            'created_at', '<=', $months_to
        )->whereIn('id', $monthlyClient)->get()->count();

        $allClientsTransactions = Transaction::where('spa_id', $id,)->groupBy('client_id')->pluck('client_id');
        $allClients = Client::whereIn('id', $allClientsTransactions)->get()->count();

        $sale = Sale::where(['user_id' => auth()->user()->id, 'payment_status' => 'paid'])->whereDate('created_at', '>=', $todays_from)->whereDate('created_at', '<=', $todays_to)->get();
---
select `client_id` from `transactions` where `spa_id` = '6d11d3d7-b866-45f8-b13d-1f6c450143ac' and `transactions`.`deleted_at` is null group by `client_id`
select * from `sales` where (`user_id` = 'e94948c9-abad-412b-a799-65f8241f0b10' and `payment_status` = 'paid') and date(`created_at`) >= '2023-06-04 00:00:00' and date(`created_at`) <= '2023-06-04 23:59:59'